In [1]:
# first i will learn Hierarchical indexing
### 8.1 Hierarchical Indexing

In [2]:
import numpy as np
import pandas as pd

In [33]:
data=pd.Series(np.random.randn(8),
                 index=[['a','b','c','a','b','c','a','c'],
                  [1,2,3,1,2,2,3,3]])

In [34]:
data.index

MultiIndex([('a', 1),
            ('b', 2),
            ('c', 3),
            ('a', 1),
            ('b', 2),
            ('c', 2),
            ('a', 3),
            ('c', 3)],
           )

In [41]:
data.sort_index()

a  1   -0.306619
   1    0.200165
   3   -0.274588
b  2   -1.243082
   2   -0.072695
c  2    1.374094
   3   -0.262068
   3    0.504777
dtype: float64

In [42]:
data

a  1   -0.306619
b  2   -1.243082
c  3   -0.262068
a  1    0.200165
b  2   -0.072695
c  2    1.374094
a  3   -0.274588
c  3    0.504777
dtype: float64

In [37]:
data.loc[["a","b"]]

a  1   -0.306619
   1    0.200165
   3   -0.274588
b  2   -1.243082
   2   -0.072695
dtype: float64

In [43]:
data.loc[:,2]

b   -1.243082
b   -0.072695
c    1.374094
dtype: float64

In [45]:
#With a DataFrame, either axis can have a hierarchical index
# [18]
import pandas as pd
import numpy as np
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
        index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
        columns=[['Ohio', 'Ohio', 'Colorado'],
        ['Green', 'Red', 'Green']])
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
display(frame)
frame['Ohio']

#Be careful to distinguish the index names 'state' and 'color'
#from the row labels

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [50]:
frame.swaplevel('key2',"key1").sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [51]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [52]:
frame.stack()

state            Colorado  Ohio
key1 key2 color
a    1    Green       2.0     0
          Red         NaN     1
     2    Green       5.0     3
          Red         NaN     4
b    1    Green       8.0     6
          Red         NaN     7
     2    Green      11.0     9
          Red         NaN    10

In [53]:
frame.stack().unstack()

state     Colorado      Ohio
color        Green Red Green Red
key1 key2
a    1         2.0 NaN     0   1
     2         5.0 NaN     3   4
b    1         8.0 NaN     6   7
     2        11.0 NaN     9  10

## from sir Qasim

In [54]:
df1 = pd.DataFrame({"CNIC": np.random.randint(1,20, size=20),
                   "Account No":np.random.randint(1,5, size=(20))})

df1.drop_duplicates(inplace=True)
df1
#12345-1234567-3
#1234512345673

    CNIC  Account No
0     16           3
1     11           2
2      1           2
3      2           2
4     18           3
5      4           3
6      8           3
7     13           1
8      9           3
9      8           2
10     2           3
11    19           1
12     5           2
13    13           2
14    19           3
15     8           1
18    17           3
19     1           4

In [89]:
[chr(i) for i in range(97,123)]

['a',
 'b',
 'c',
 'd',
 'e',
 'f',
 'g',
 'h',
 'i',
 'j',
 'k',
 'l',
 'm',
 'n',
 'o',
 'p',
 'q',
 'r',
 's',
 't',
 'u',
 'v',
 'w',
 'x',
 'y',
 'z']

In [88]:
chr(122)

'z'

In [75]:
a=pd.DataFrame({"CNIC":(np.random.randint(1,20,size=20)),
               "Account No":(np.random.randint(1,5,size=20)),
               "DOB":pd.date_range("1990-01-01",freq="M",periods=20),
               "cell no":np.random.randint(2000,3000,size=20),
               "Name":[chr(x) for x in (np.random.randint(65,91,size=20))],
               "Gender":np.random.choice(["M","F"],size=20)})

In [77]:
a

    CNIC  Account No        DOB  cell no Name Gender
0      1           3 1990-01-31     2458    Y      M
1     15           1 1990-02-28     2653    M      M
2      9           2 1990-03-31     2883    Z      M
3     11           2 1990-04-30     2456    O      F
4     18           3 1990-05-31     2296    E      M
5     18           3 1990-06-30     2031    I      M
6      2           4 1990-07-31     2807    V      M
7     11           2 1990-08-31     2776    T      M
8     16           2 1990-09-30     2284    B      F
9     19           1 1990-10-31     2338    F      M
10    12           4 1990-11-30     2528    I      F
11     9           1 1990-12-31     2642    A      M
12    17           4 1991-01-31     2861    M      F
13    14           3 1991-02-28     2011    Y      F
14    19           4 1991-03-31     2459    E      M
15    16           1 1991-04-30     2116    Z      M
16    14           3 1991-05-31     2403    F      M
17     9           4 1991-06-30     2347    U      M
18    10           1 1991-07-31     2637    Z      M
19     7           1 1991-08-31     2907    M      F

In [78]:
print(len(df1))
print(len(a))
b=df1.merge(a,on="CNIC",how="inner")
print(len(b))
b

18
20
18

    CNIC  Account No_x  Account No_y        DOB  cell no Name Gender
0     16             3             2 1990-09-30     2284    B      F
1     16             3             1 1991-04-30     2116    Z      M
2     11             2             2 1990-04-30     2456    O      F
3     11             2             2 1990-08-31     2776    T      M
4      1             2             3 1990-01-31     2458    Y      M
5      1             4             3 1990-01-31     2458    Y      M
6      2             2             4 1990-07-31     2807    V      M
7      2             3             4 1990-07-31     2807    V      M
8     18             3             3 1990-05-31     2296    E      M
9     18             3             3 1990-06-30     2031    I      M
10     9             3             2 1990-03-31     2883    Z      M
11     9             3             1 1990-12-31     2642    A      M
12     9             3             4 1991-06-30     2347    U      M
13    19             1             1 1990-10-31     2338    F      M
14    19             1             4 1991-03-31     2459    E      M
15    19             3             1 1990-10-31     2338    F      M
16    19             3             4 1991-03-31     2459    E      M
17    17             3             4 1991-01-31     2861    M      F

In [90]:
df1.columns

Index(['CNIC', 'Account No'], dtype='object')

In [92]:
df1.columns=["Customer CNIC","Customer Account no"]

In [94]:
print(len(df1))
print(len(a))
b=df1.merge(a, left_on="Customer CNIC",right_on="CNIC",how="inner")
print(len(b))
b.drop_duplicates()

18
20
18

,Customer CNIC,Customer Account no,CNIC,Account No,DOB,cell no,Name,Gender
0,16,3,16,2,1990-09-30,2284,B,F
1,16,3,16,1,1991-04-30,2116,Z,M
2,11,2,11,2,1990-04-30,2456,O,F
3,11,2,11,2,1990-08-31,2776,T,M
4,1,2,1,3,1990-01-31,2458,Y,M
5,1,4,1,3,1990-01-31,2458,Y,M
6,2,2,2,4,1990-07-31,2807,V,M
7,2,3,2,4,1990-07-31,2807,V,M
8,18,3,18,3,1990-05-31,2296,E,M
9,18,3,18,3,1990-06-30,2031,I,M
10,9,3,9,2,1990-03-31,2883,Z,M
11,9,3,9,1,1990-12-31,2642,A,M
12,9,3,9,4,1991-06-30,2347,U,M
13,19,1,19,1,1990-10-31,2338,F,M
14,19,1,19,4,1991-03-31,2459,E,M
15,19,3,19,1,1990-10-31,2338,F,M
16,19,3,19,4,1991-03-31,2459,E,M
17,17,3,17,4,1991-01-31,2861,M,F